.mule/plugins-tmp/mule-workday-connector-12.0.0-mule-plugin/validationService.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bsvc="urn:com.workday/bsvc">
    <soapenv:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                       soapenv:mustUnderstand="1">
            <wsse:UsernameToken>
                <wsse:Username></wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText"></wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <bsvc:Get_Workday_Account_Signons_Request bsvc:version="v34.0">
            <bsvc:Request_Criteria>
                <bsvc:User_Name></bsvc:User_Name>
            </bsvc:Request_Criteria>
            <bsvc:Response_Filter>
                <bsvc:Page>1</bsvc:Page>
                <bsvc:Count>1</bsvc:Count>
            </bsvc:Response_Filter>
        </bsvc:Get_Workday_Account_Signons_Request>
    </soapenv:Body>
</soapenv:Envelope>